"""
а б в г д е ж ꙃ(ꙅ,ѕ) ꙁ (і,и) к л м н о п р с т оу(ѹ,ꙋ) ф х ш ц  щ ъ ꙑ(ы) ь ѣ ю ꙗ  ѧ ѫ ѩ ѭ ѯ ѱ ѳ у(ѵ)
α β γ δ ε ζ η θ(ϑ) ι κ(ϰ) λ μ ν ξ ο π ρ σ τ υ ϕ(φ) χ ψ ω
"""

remap = {
    "ꙃ": ord("ж") + 0.5,
    "ꙅ": ord("ж") + 0.5,
    "ѕ": ord("ж") + 0.5,
    "ꙁ": ord("ж") + 1,
    "": ord("и"),
    "і": ord("и"),
    "ꙋ": ord("т") + 0.5,
    "ѹ": ord("т") + 0.5,
    "ш": ord("х") + 0.5,
    "": ord("ц") + 0.5,
    "ꙑ": ord("ы"),
    "ѣ": ord("ь") + 0.5,
    "ꙗ": ord("ю") + 0.5,
    "": ord("ю") + 1,
    "ѩ": ord("ѫ") + 0.5,
    "у": ord("ѵ"),
    "ϕ": ord("υ") + 0.5,
    "ϑ": ord("η") + 0.5,
    "ϰ": ord("ι") + 0.5,
    #    "\ue010": ord(""),
    #    "\ue201": ord("а"),
    #    "\ue204": ord("н"),
    #    "\ue205": ord("н"),
    #    "\ue010": ord("о"),
    #    "\ue20c": ord("о"),
    #    "\ue20d": ord("о")
}
