from const import IDX_COL
from setup import sl_sem, gr_sem
from merger import merge, _close, _close_group

raw = [
    [""] * 4
    + ["38/178c06"]
    + ["ₓ", ""] * 2
    + [""] * 2
    + ["τῶν", "ὁ"]
    + [""] * 13
    + ["hl11:FFFCD5B4|hl14:FFB8CCE4"],
    [""] * 4
    + ["38/178c06", "словесъ", "\ue205хъ словесъ въспⷪ҇-", "слово"]
    + [""] * 3
    + ["εἰρημένων", "λέγω", "τὸ εἰρημένον"]
    + [""] * 12
    + ["hl11:FFFCD5B4"],
]


def test_merge_sloves_inverse():
    rows = [r.copy() for r in raw]
    result = merge(rows, gr_sem, sl_sem)

    assert result == [
        [""] * 4
        + ["38/178c06", "ₓ словесъ", "", "ₓ"]
        + [""] * 3
        + ["τῶν εἰρημένων", "ὁ"]
        + [""] * 13
        + ["hl11:FFFCD5B4|hl14:FFB8CCE4"]
        + ["1"] * 4,
        [""] * 4
        + ["38/178c06", "ₓ словесъ", "\ue205хъ словесъ въспⷪ҇-", "слово"]
        + [""] * 3
        + ["τῶν εἰρημένων", "λέγω", "τὸ εἰρημένον"]
        + [""] * 12
        + ["hl11:FFFCD5B4"]
        + ["1"] * 4,
    ]


def test_close_sloves_inverse():
    rows = [r.copy() for r in raw]
    result = _close(rows, gr_sem, sl_sem)

    assert result == [
        [""] * 4
        + ["38/178c06", "ₓ словесъ", "", "ₓ"]
        + [""] * 3
        + ["τῶν εἰρημένων", "ὁ"]
        + [""] * 13
        + ["hl11:FFFCD5B4|hl14:FFB8CCE4"],
        [""] * 4
        + ["38/178c06", "ₓ словесъ", "\ue205хъ словесъ въспⷪ҇-", "слово"]
        + [""] * 3
        + ["τῶν εἰρημένων", "λέγω", "τὸ εἰρημένον"]
        + [""] * 12
        + ["hl11:FFFCD5B4"],
    ]


def test_merge_avramov_chad():
    rows = [
        [""] * 4
        + ["05/24b21"]
        + ["ₓ", ""] * 2
        + [""] * 2
        + ["τοὺς", "ὁ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl14:FFB4C7E7"],
        [""] * 4
        + ["05/24b21", "авраамовоу", "н\ue205ша сѧ• авраа-", "авраамовъ"]
        + [""] * 3
        + ["περὶ", "περί", "περί + Acc.", "ὁ περὶ τὸν Ἀβραάμ"]
        + [""] * 11
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl13:FF92D050"],
        [""] * 4
        + ["", "ₓ"] * 2
        + [""] * 3
        + ["τὸν", "ὁ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl14:FFB4C7E7"],
        [""] * 4
        + [
            "05/24c01",
            "\ue20dадь",
            "мовоу \ue20dадь г\ue010лю-",
            "\ue20dѧдь",
            "авраамова \ue20dѧдь",
        ]
        + [""] * 2
        + ["Ἀβραὰμ", "Ἀβραάμ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4"],
    ]

    result = merge(rows, sl_sem, gr_sem)

    assert result == [
        [""] * 4
        + ["05/24b21", "ₓ авраамовоу ₓ \ue20dадь", "", "ₓ"]
        + [""] * 3
        + ["τοὺς περὶ τὸν Ἀβραὰμ", "ὁ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl14:FFB4C7E7"]
        + ["1"] * 4,
        [""] * 4
        + [
            "05/024b21-c01",
            "ₓ авраамовоу ₓ \ue20dадь",
            "н\ue205ша сѧ• авраа-",
            "авраамовъ",
        ]
        + [""] * 3
        + ["τοὺς περὶ τὸν Ἀβραὰμ", "περί & Ἀβραάμ", "περί + Acc.", "ὁ περὶ τὸν Ἀβραάμ"]
        + [""] * 11
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl13:FF92D050"]
        + ["1"] * 4,
        [""] * 4
        + ["05/24b21", "ₓ авраамовоу ₓ \ue20dадь", "", "ₓ"]
        + [""] * 3
        + ["τοὺς περὶ τὸν Ἀβραὰμ", "ὁ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl14:FFB4C7E7", "2"]
        + ["1"] * 3,
        [""] * 4
        + [
            "05/024b21-c01",
            "ₓ авраамовоу ₓ \ue20dадь",
            "мовоу \ue20dадь г\ue010лю-",
            "\ue20dѧдь",
            "авраамова \ue20dѧдь",
        ]
        + [""] * 2
        + ["τοὺς περὶ τὸν Ἀβραὰμ", "περί & Ἀβραάμ", "", "ὁ περὶ τὸν Ἀβραάμ"]
        + [""] * 11
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4"]
        + ["1"] * 4,
    ]


def test_merge_avramov_chad_inverse():
    rows = [
        [""] * 4
        + ["05/24b21"]
        + ["ₓ", ""] * 2
        + [""] * 2
        + ["τοὺς", "ὁ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl14:FFB4C7E7"],
        [""] * 4
        + ["05/24b21", "авраамовоу", "н\ue205ша сѧ• авраа-", "авраамовъ"]
        + [""] * 3
        + ["περὶ", "περί", "περί + Acc.", "ὁ περὶ τὸν Ἀβραάμ"]
        + [""] * 11
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl13:FF92D050"],
        [""] * 4
        + ["", "ₓ"] * 2
        + [""] * 3
        + ["τὸν", "ὁ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl14:FFB4C7E7"],
        [""] * 4
        + [
            "05/24c01",
            "\ue20dадь",
            "мовоу \ue20dадь г\ue010лю-",
            "\ue20dѧдь",
            "авраамова \ue20dѧдь",
        ]
        + [""] * 2
        + ["Ἀβραὰμ", "Ἀβραάμ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4"],
    ]

    result = merge(rows, gr_sem, sl_sem)

    assert result == [
        [""] * 4
        + ["05/24b21", "ₓ авраамовоу ₓ \ue20dадь", "", "ₓ"]
        + [""] * 3
        + ["τοὺς περὶ τὸν Ἀβραὰμ", "ὁ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl14:FFB4C7E7"]
        + ["1"] * 4,
        [""] * 4
        + [
            "05/024b21-c01",
            "ₓ авраамовоу ₓ \ue20dадь",
            "н\ue205ша сѧ• авраа-",
            "авраамовъ & \ue20dѧдь",
        ]
        + [""] * 3
        + ["τοὺς περὶ τὸν Ἀβραὰμ", "περί", "περί + Acc.", "ὁ περὶ τὸν Ἀβραάμ"]
        + [""] * 11
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl13:FF92D050"]
        + ["1"] * 4,
        [""] * 4
        + ["05/24b21", "ₓ авраамовоу ₓ \ue20dадь", "", "ₓ"]
        + [""] * 3
        + ["τοὺς περὶ τὸν Ἀβραὰμ", "ὁ"]
        + [""] * 13
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4|hl14:FFB4C7E7", "2"]
        + ["1"] * 3,
        [""] * 4
        + [
            "05/024b21-c01",
            "ₓ авраамовоу ₓ \ue20dадь",
            "мовоу \ue20dадь г\ue010лю-",
            "авраамовъ & \ue20dѧдь",
            "авраамова \ue20dѧдь",
        ]
        + [""] * 2
        + ["τοὺς περὶ τὸν Ἀβραὰμ", "Ἀβραάμ", "", "ὁ περὶ τὸν Ἀβραάμ"]
        + [""] * 11
        + ["hl05:FFC5E0B4|hl11:FFC5E0B4"]
        + ["1"] * 4,
    ]


def test_merge_iakov_brata():
    rows = [
        [""] * 4
        + ["38/181a19"]
        + ["ₓ", ""] * 2
        + [""] * 7
        + ["οἱ", "ὁ"]
        + [""] * 8
        + ["hl05:FFFCD5B4|hl16:FFFCD5B4|hl19:FFB4C7E7"],
        [""] * 4
        + [
            "38/181a19",
            "\ue205ꙗковъ",
            "\ue20dоуть сꙗ \ue205ꙗко-",
            "\ue205ꙗковъ",
            "\ue205аковъ \ue205 брат\ue205ꙗ \ue201го",
        ]
        + [""] * 2
        + ["om."] * 2
        + [""] * 3
        + ["περὶ", "περί", "περί + Acc.", "οἱ περὶ Ἰάκωβον"]
        + [""] * 6
        + ["hl05:FFFCD5B4|hl16:FFFCD5B4|hl18:FFA9D18E"],
        [""] * 4
        + ["38/181a20", "\ue205", "въ \ue205 брат\ue205ꙗ его•", "\ue205 conj."]
        + [""] * 8
        + ["Ἰάκωβον", "Ἰάκωβος"]
        + [""] * 8
        + ["hl05:FFFCD5B4|hl16:FFFCD5B4"],
        [""] * 4
        + ["38/181a20", "брат\ue205ꙗ", "въ \ue205 брат\ue205ꙗ его•", "брат\ue205ꙗ"]
        + [""] * 18
        + ["hl05:FFFCD5B4"],
        [""] * 4
        + ["38/181a20", "его•", "въ \ue205 брат\ue205ꙗ его•", "\ue205 pron."]
        + [""] * 18
        + ["hl05:FFFCD5B4"],
    ]

    result = merge(rows, sl_sem, gr_sem)

    assert result == [
        [""] * 4
        + ["38/181a19", "ₓ \ue205ꙗковъ \ue205 брат\ue205ꙗ его•", "", "ₓ"]
        + [""] * 3
        + ["om."]
        + [""] * 4
        + ["οἱ περὶ Ἰάκωβον Cs", "ὁ"]
        + [""] * 8
        + ["hl05:FFFCD5B4|hl16:FFFCD5B4|hl19:FFB4C7E7"]
        + ["1"] * 4,
        [""] * 4
        + [
            "38/181a19-20",
            "ₓ \ue205ꙗковъ \ue205 брат\ue205ꙗ его•",
            "\ue20dоуть сꙗ \ue205ꙗко-",
            "\ue205ꙗковъ",
            "\ue205аковъ \ue205 брат\ue205ꙗ \ue201го",
        ]
        + [""] * 2
        + ["om."] * 2
        + [""] * 3
        + [
            "οἱ περὶ Ἰάκωβον Cs",
            "περί & Ἰάκωβος Cs",
            "περί + Acc.",
            "οἱ περὶ Ἰάκωβον Cs",
        ]
        + [""] * 6
        + ["hl05:FFFCD5B4|hl16:FFFCD5B4|hl18:FFA9D18E"]
        + ["1"] * 4,
        [""] * 4
        + [
            "38/181a19-20",
            "ₓ \ue205ꙗковъ \ue205 брат\ue205ꙗ его•",
            "въ \ue205 брат\ue205ꙗ его•",
            "\ue205 conj.",
            # "\ue205аковъ \ue205 брат\ue205ꙗ \ue201го",
        ]
        + [""] * 3
        + ["om."] * 2
        + [""] * 3
        + ["οἱ περὶ Ἰάκωβον Cs", "περί & Ἰάκωβος Cs", "", "οἱ περὶ Ἰάκωβον Cs"]
        + [""] * 6
        + ["hl05:FFFCD5B4|hl16:FFFCD5B4"]
        + ["1"] * 4,
        [""] * 4
        + [
            "38/181a19-20",
            "ₓ \ue205ꙗковъ \ue205 брат\ue205ꙗ его•",
            "въ \ue205 брат\ue205ꙗ его•",
            "брат\ue205ꙗ",
            # "\ue205аковъ \ue205 брат\ue205ꙗ \ue201го",
        ]
        + [""] * 3
        + ["om."] * 2
        + [""] * 3
        + ["οἱ περὶ Ἰάκωβον Cs", "περί & Ἰάκωβος Cs", "", "οἱ περὶ Ἰάκωβον Cs"]
        + [""] * 6
        + ["hl05:FFFCD5B4"]
        + ["1"] * 4,
        [""] * 4
        + [
            "38/181a19-20",
            "ₓ \ue205ꙗковъ \ue205 брат\ue205ꙗ его•",
            "въ \ue205 брат\ue205ꙗ его•",
            "\ue205 pron.",
            # "\ue205аковъ \ue205 брат\ue205ꙗ \ue201г",
        ]
        + [""] * 3
        + ["om."] * 2
        + [""] * 3
        + ["οἱ περὶ Ἰάκωβον Cs", "περί & Ἰάκωβος Cs", "", "οἱ περὶ Ἰάκωβον Cs"]
        + [""] * 6
        + ["hl05:FFFCD5B4"]
        + ["1"] * 4,
    ]


def test_gen_lemma2():
    rows = [
        [""] * 4
        + ["14/71c11", "въ\ue205ноу", "ща въ\ue205ноу• по-", "въ\ue205нѫ"]
        + [""] * 3
        + ["διηνεκῶς"] * 2
        + [""] * 3
        + ["διὰ MVPa", "διά", "διά + Gen", "διὰ παντός"]
        + [""] * 6
        + ["hl16:FFFCD5B5|hl18:FF92D050"],
        [""] * 16 + ["παντός MVPa", "πᾶς"] + [""] * 8 + ["hl16:FFFCD5B5"],
    ]

    result = merge(rows, gr_sem.var, sl_sem)

    assert result == [
        [""] * 4
        + ["14/071c11", "въ\ue205ноу", "ща въ\ue205ноу• по-", "въ\ue205нѫ"]
        + [""] * 3
        + ["διηνεκῶς"] * 2
        + [""] * 3
        + ["διὰ παντός MVPa", "διά MVPa", "διά + Gen", "διὰ παντός MVPa"]
        + [""] * 6
        + ["hl16:FFFCD5B5|hl18:FF92D050"]
        + ["1"] * 4,
        [""] * 4
        + ["14/071c11", "въ\ue205ноу", "", "въ\ue205нѫ"]
        + [""] * 3
        + ["διηνεκῶς"] * 2
        + [""] * 3
        + ["διὰ παντός MVPa", "πᾶς MVPa", "", "διὰ παντός MVPa"]
        + [""] * 6
        + ["hl16:FFFCD5B5"]
        + ["1"] * 4,
    ]
