from setup import sl_sem, gr_sem
from merger import merge


def test_dobrodetel():
    rows = [
        ["добрѣ\ue205 W", "добродѣтѣль GH"]
        + [""] * 2
        + ["33/153d16", "добрѣ", "то\ue205 добрѣ дѣ-", "добръ", "добра дѣтѣль"]
        + [""] * 2
        + ["Ø"] * 2
        + [""] * 13
        + ["hl05:FFF8CBAD"],
        ["добродѣтел\ue205 GH"]
        + [""] * 3
        + ["33/153d16", "дѣтел\ue205•", "то\ue205 добрѣ дѣ-", "дѣтѣль"]
        + [""] * 2
        + ["Ø"] * 2
        + [""] * 14
        + ["hl05:FFF8CBAD"],
    ]
    result = merge([r.copy() for r in rows], sl_sem.var, gr_sem)

    assert result == [
        ["добрѣ\ue205 W добродѣтел\ue205 GH", "добродѣтѣль GH"]
        + [""] * 2
        + [
            "33/153d16",
            "добрѣ дѣтел\ue205•",
            "то\ue205 добрѣ дѣ-",
            "добръ & дѣтѣль",
            "добра дѣтѣль",
            "",
        ]
        + ["Ø", "Ø Ø", "Ø"]
        + [""] * 13
        + ["hl05:FFF8CBAD"]
        + ["1"] * 4,
        ["добрѣ\ue205 W добродѣтел\ue205 GH"]
        + [""] * 3
        + [
            "33/153d16",
            "добрѣ дѣтел\ue205•",
            "то\ue205 добрѣ дѣ-",
            "добръ & дѣтѣль",
            "добра дѣтѣль",
            "",
        ]
        + ["Ø", "Ø Ø", "Ø"]
        + [""] * 13
        + ["hl05:FFF8CBAD"]
        + ["1"] * 4,
    ]


def test_lepota():
    rows = [
        [
            "по WG",
            "по",
            "по + Dat.",
            "по лѣпотѣ",
            "47/212b18",
            "въ",
            "ть• \ue205 ꙁѣло же въ",
            "въ",
            "въ + Acc.",
            "въ лѣпотѫ",
            "",
        ]
        + ["εἰκότως"] * 2
        + [""] * 13
        + ["hl05:FFFCD5B4|hl00:FFF8CBAD|hl08:FF92D050|hl02:FF92D050"],
        ["лѣпотѣ WG", "лѣпота"]
        + [""] * 2
        + [
            "47/212b19",
            "лѣпотѫ•",
            "лѣпотѫ• ꙗко с\ue205-",
            "лѣпота",
        ]
        + [""] * 18
        + ["hl05:FFFCD5B4|hl00:FFF8CBAD"],
    ]

    result = merge([r.copy() for r in rows], sl_sem, gr_sem)
    assert result == [
        [
            "по лѣпотѣ WG",
            "по & лѣпота WG",
            "по + Dat.",
            "по лѣпотѣ",
            "47/212b18-19",
            "въ лѣпотѫ•",
            "ть• \ue205 ꙁѣло же въ",
            "въ",
            "въ + Acc.",
            "въ лѣпотѫ",
            "",
        ]
        + ["εἰκότως"] * 2
        + [""] * 13
        + ["hl05:FFFCD5B4|hl00:FFF8CBAD|hl08:FF92D050|hl02:FF92D050"]
        + ["1"] * 4,
        [
            "по лѣпотѣ WG",
            "по & лѣпота WG",
            "по + Dat. WG",
            "по лѣпотѣ WG",
            "47/212b18-19",
            "въ лѣпотѫ•",
            "лѣпотѫ• ꙗко с\ue205-",
            "лѣпота",
            "въ лѣпотѫ",
        ]
        + [""] * 2
        + ["εἰκότως"] * 2
        + [""] * 13
        + ["hl05:FFFCD5B4|hl00:FFF8CBAD"]
        + ["1"] * 4,
    ]

    result = merge([r.copy() for r in rows], sl_sem, gr_sem)
    assert result == [
        [
            "по лѣпотѣ WG",
            "по & лѣпота WG",
            "по + Dat.",
            "по лѣпотѣ",
            "47/212b18-19",
            "въ лѣпотѫ•",
            "ть• \ue205 ꙁѣло же въ",
            "въ",
            "въ + Acc.",
            "въ лѣпотѫ",
            "",
        ]
        + ["εἰκότως"] * 2
        + [""] * 13
        + ["hl05:FFFCD5B4|hl00:FFF8CBAD|hl08:FF92D050|hl02:FF92D050"]
        + ["1"] * 4,
        [
            "по лѣпотѣ WG",
            "по & лѣпота WG",
            "по + Dat. WG",
            "по лѣпотѣ WG",
            "47/212b18-19",
            "въ лѣпотѫ•",
            "лѣпотѫ• ꙗко с\ue205-",
            "лѣпота",
            "въ лѣпотѫ",
        ]
        + [""] * 2
        + ["εἰκότως"] * 2
        + [""] * 13
        + ["hl05:FFFCD5B4|hl00:FFF8CBAD"]
        + ["1"] * 4,
    ]

    result = merge([r.copy() for r in rows], gr_sem, sl_sem)
    assert result == [
        [
            "по лѣпотѣ WG",
            "по & лѣпота WG",
            "",
            "по лѣпотѣ WG",
            "47/212b18-19",
            "въ лѣпотѫ•",
            "ть• \ue205 ꙁѣло же въ",
            "въ & лѣпота",
            "",
            "въ лѣпотѫ",
            "",
        ]
        + ["εἰκότως"] * 2
        + [""] * 13
        + ["hl05:FFFCD5B4|hl00:FFF8CBAD|hl08:FF92D050|hl02:FF92D050"]
        + ["1"] * 4,
        [
            "по лѣпотѣ WG",
            "по & лѣпота WG",
            "",
            "по лѣпотѣ WG",
            "47/212b18-19",
            "въ лѣпотѫ•",
            "лѣпотѫ• ꙗко с\ue205-",
            "въ & лѣпота",
            "",
            "въ лѣпотѫ",
            "",
            "εἰκότως",
        ]
        + [""] * 14
        + ["hl05:FFFCD5B4|hl00:FFF8CBAD"]
        + ["1"] * 4,
    ]
