from typing import List

from semantics import MainLangSemantics, VarLangSemantics
from merger import _close, _grouped, _group_variants


def test_grouped():
    sl_sem = MainLangSemantics(
        "sl", 5, [7, 8, 9, 10], VarLangSemantics("sl", 0, [1, 2, 3])
    )
    gr_sem = MainLangSemantics(
        "gr", 11, [12, 13, 14], VarLangSemantics("gr", 16, [17, 18, 19])
    )

    row = (
        [
            "\ue201л\ue205ко WH",
            "\ue201л\ue205къ",
        ]
        + [""] * 2
        + [
            "1/7c12",
            "сел\ue205ко",
            "въ сел\ue205ко",
            "сел\ue205къ",
        ]
        + [""] * 3
        + ["τοῦτο", "οὗτος"]
        + [""] * 13
        + ["hl05|hl00|hl11"]
    )
    assert _grouped(row, gr_sem)

    row = (
        [""] * 4
        + ["1/7d1", "насъ", "оу насъ", "мꙑ"]
        + [""] * 3
        + ["om.", "om."]
        + [""] * 3
        + ["ἡμῖν", "ἡμεῖς"]
        + [""] * 9
    )
    assert not _grouped(row, sl_sem)
    row = (
        [
            "вѣроу GH",
            "вѣра",
            "вѣрѫ ѩт\ue205",
            "",
            "1/7b19",
            "вѣроують",
            "вьс\ue205 вѣроують",
            "вѣроват\ue205",
        ]
        + [""] * 3
        + [
            "πιστεύσωσι",
            "πιστεύω",
        ]
        + [""] * 13
        + ["hl00"]
    )
    assert _grouped(row, sl_sem)
    row = ["\ue205моуть GH", "ѩт\ue205"] + [""] * 2 + ["1/7b19"] + [""] * 21 + ["hl00"]
    assert _grouped(row, sl_sem)


def test_group_variants():
    sl_sem = MainLangSemantics(
        "sl", 5, [7, 8, 9, 10], VarLangSemantics("sl", 0, [1, 2, 3])
    )
    gr_sem = MainLangSemantics(
        "gr", 11, [12, 13, 14], VarLangSemantics("gr", 16, [17, 18, 19])
    )

    g1 = (
        [""] * 2
        + [
            "тѣмь \ue205л\ue205",
            "",
            "1/6a10",
            "тѣмь",
            "тѣмь л\ue205 в\ue205д\ue205мо",
            "тѣмь",
            "тѣмь л\ue205",
        ]
        + [""] * 2
        + ["κἂν"] * 2
        + [""] * 13
        + ["hl04"]
    )
    g2 = [
        "\ue205л\ue205 WH",
        "\ue205л\ue205",
        "",
        "",
        "1/6a10",
        "л\ue205",
        "тѣмь л\ue205 в\ue205д\ue205мо",
        "л\ue205",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "hl04",
    ]
    group = [g1, g2]
    res = _group_variants(group, sl_sem)
    assert res == "WH"

    group = [
        [
            "\ue205л\ue205 WH",
            "\ue205л\ue205",
            "",
            "",
            "1/6a11",
            "л\ue205 ",
            "\ue201сть л\ue205 раꙁѹмьно",
            "л\ue205 ",
        ]
        + [""] * 3
        + [
            "κἂν",
            "καί",
            "κἄν",
        ]
        + [""] * 12
        + ["hl11"],
        [""] * 4 + ["1/6a11"] + [""] * 7 + ["ἀν"] + [""] * 13 + ["hl11"],
    ]
    res = _close(group, sl_sem, gr_sem)
    expected = [
        [
            "\ue205л\ue205 WH",
            "\ue205л\ue205",
        ]
        + [""] * 2
        + [
            "01/006a11",
            "л\ue205 ",
            "\ue201сть л\ue205 раꙁѹмьно",
            "л\ue205 ",
        ]
        + [""] * 3
        + [
            "κἂν",
            "καί & ἀν",
            "κἄν",
        ]
        + [""] * 12
        + ["hl11"],
        [
            "\ue205л\ue205 WH",
        ]
        + [""] * 3
        + [
            "01/006a11",
            "л\ue205 ",
        ]
        + [""] * 5
        + [
            "κἂν",
            "καί & ἀν",
            "κἄν",
        ]
        + [""] * 12
        + ["hl11"],
    ]
    assert res == expected

    group = [
        ["\ue205л\ue205 WH", "\ue205л\ue205"]
        + [""] * 2
        + [
            "1/6a11",
            "л\ue205 ",
            "\ue201сть л\ue205 раꙁѹмьно",
            "л\ue205 ",
        ]
        + [""] * 3
        + [
            "κἂν",
            "καί",
            "κἄν",
        ]
        + [""] * 12
        + ["hl11"],
        [""] * 4
        + ["1/6a11"]
        + [""] * 7
        + ["ἀν"]
        + [""] * 13
        + [
            "hl11",
        ],
    ]
    res = _close(group, gr_sem, sl_sem)
    expected = [
        ["\ue205л\ue205 WH", "\ue205л\ue205"]
        + [""] * 2
        + [
            "01/006a11",
            "л\ue205 ",
            "\ue201сть л\ue205 раꙁѹмьно",
            "л\ue205 ",
        ]
        + [""] * 3
        + [
            "κἂν",
            "καί",
            "κἄν",
        ]
        + [""] * 12
        + ["hl11"],
        ["\ue205л\ue205 WH", "\ue205л\ue205"]
        + [""] * 2
        + [
            "01/006a11",
            "л\ue205 ",
            "",
            "л\ue205 ",
        ]
        + [""] * 3
        + [
            "κἂν",
            "ἀν",
            "κἄν",
        ]
        + [""] * 12
        + ["hl11"],
    ]
    assert res == expected

    # TODO
    group = [
        [""] * 4
        + ["1/6a10", "тѣмь", "тѣмь л\ue205 в\ue205д\ue205мо", "тѣмь", "тѣмь л\ue205"]
        + [""] * 2
        + [
            "κἂν",
            "καί",
            "κἄν",
        ]
        + [""] * 12
        + ["hl05"],
        ["\ue205л\ue205 WH", "\ue205л\ue205"]
        + [""] * 2
        + [
            "1/6a10",
            "л\ue205",
            "тѣмь л\ue205 в\ue205д\ue205мо",
            "л\ue205",
        ]
        + [""] * 4
        + ["ἀν"]
        + [""] * 13
        + ["hl05"],
    ]
    res = _close(group, sl_sem, gr_sem)
    expected = [
        ["тѣмь \ue205л\ue205 WH", "тѣмь"]
        + [""] * 2
        + [
            "01/006a10",
            "тѣмь л\ue205",
            "тѣмь л\ue205 в\ue205д\ue205мо",
            "тѣмь",
            "тѣмь л\ue205",
        ]
        + [""] * 2
        + [
            "κἂν",
            "καί & ἀν",
            "κἄν",
        ]
        + [""] * 12
        + ["hl05"],
        ["тѣмь \ue205л\ue205 WH", "\ue205л\ue205"]
        + [""] * 2
        + [
            "01/006a10",
            "тѣмь л\ue205",
            "тѣмь л\ue205 в\ue205д\ue205мо",
            "л\ue205",
            "тѣмь л\ue205",
        ]
        + [""] * 2
        + [
            "κἂν",
            "καί & ἀν",
            "κἄν",
        ]
        + [""] * 12
        + ["hl05"],
    ]
    assert res == expected

    group = [
        [""] * 4
        + ["1/6a10", "тѣмь", "тѣмь л\ue205 в\ue205д\ue205мо", "тѣмь", "тѣмь л\ue205"]
        + [""] * 2
        + [
            "κἂν",
            "καί",
            "κἄν",
        ]
        + [""] * 12
        + ["hl05"],
        ["\ue205л\ue205 WH", "\ue205л\ue205"]
        + [""] * 2
        + [
            "1/6a10",
            "л\ue205",
            "тѣмь л\ue205 в\ue205д\ue205мо",
            "л\ue205",
        ]
        + [""] * 4
        + ["ἀν"]
        + [""] * 13
        + ["hl05"],
    ]
    res = _close(group, gr_sem, sl_sem)
    expected = [
        ["\ue205л\ue205 WH", "\ue205л\ue205"]
        + [""] * 2
        + [
            "01/006a10",
            "тѣмь л\ue205",
            "тѣмь л\ue205 в\ue205д\ue205мо",
            "тѣмь & л\ue205",
            "тѣмь л\ue205",
        ]
        + [""] * 2
        + [
            "κἂν",
            "καί",
            "κἄν",
        ]
        + [""] * 12
        + ["hl05"],
        ["\ue205л\ue205 WH", "\ue205л\ue205"]
        + [""] * 2
        + [
            "01/006a10",
            "тѣмь л\ue205",
            "тѣмь л\ue205 в\ue205д\ue205мо",
            "тѣмь & л\ue205",
            "тѣмь л\ue205",
        ]
        + [""] * 2
        + [
            "κἂν",
            "ἀν",
            "κἄν",
        ]
        + [""] * 12
        + ["hl05"],
    ]
    assert res == expected

    g1 = (
        [""] * 4
        + ["1/W168a13"]
        + ["ₓ", ""] * 2
        + [""] * 2
        + ["ταῖς", "ὁ"]
        + [""] * 13
        + ["hl11"]
    )
    g2 = (
        [""] * 4
        + [
            "1/W168a13",
            "вышьн\ue205\ue205мь",
            "вышьн\ue205\ue205мь с\ue205ламь•",
            "вꙑшьнь",
        ]
        + [""] * 3
        + ["ἄνω", "ἄνω", "ὁ ἄνω"]
        + [""] * 12
        + ["hl11"]
    )
    group = [g1, g2]

    res = _close(group, gr_sem, sl_sem)
    e1 = (
        [""] * 4
        + ["01/W168a13", "ₓ вышьн\ue205\ue205мь", "", "вꙑшьнь"]
        + [""] * 3
        + ["ταῖς ἄνω", "ὁ", "ὁ ἄνω"]
        + [""] * 12
        + ["hl11"]
    )
    e2 = (
        [""] * 4
        + [
            "01/W168a13",
            "ₓ вышьн\ue205\ue205мь",
            "вышьн\ue205\ue205мь с\ue205ламь•",
            "вꙑшьнь",
        ]
        + [""] * 3
        + ["ταῖς ἄνω", "ἄνω", "ὁ ἄνω"]
        + [""] * 12
        + ["hl11"]
    )
    expected = [e1, e2]
    assert res == expected
