from setup import sl_sem, gr_sem


def test_puteshestive():
    rows = [
        [
            "шьст\ue205ꙗ G шьств\ue205ꙗ H",
            "шьст\ue205\ue201 G / шьств\ue205\ue201 H",
            "шьст\ue205\ue201 пѫт\ue205 G / шьств\ue205\ue201 пѫт\ue205 H",
            "",
            "05/028d18",
            "поутошьств\ue205ꙗ",
            "поутошьств\ue205-",
            "пѫтошьств\ue205\ue201",
        ]
        + [""] * 3
        + ["ὁδοιπορίας", "ὁδοιπορία"]
        + [""] * 13
        + ["hl00"]
        + ["1"] * 4,
        [
            "пꙋт\ue205 GH",
            "пѫть",
            "шьст\ue205\ue201 пѫт\ue205 G / шьств\ue205\ue201 пѫт\ue205 H",
            "",
            "05/028d18",
            "поутошьств\ue205ꙗ",
            "",
            "пѫтошьств\ue205\ue201",
        ]
        + [""] * 3
        + ["ὁδοιπορίας", "ὁδοιπορία"]
        + [""] * 13
        + ["hl00"]
        + ["1"] * 4,
    ]

    assert (
        sl_sem.var.collect_word(rows)
        == "шьст\ue205ꙗ пꙋт\ue205 G шьств\ue205ꙗ пꙋт\ue205 H"
    )


def test_prichatnik_biti():
    rows = [
        [
            "пр\ue205\ue20dестьн\ue205ц\ue205 б• G  пр\ue205\ue20dестн\ue205ц\ue205 б• H",
            "пр\ue205\ue20dѧстьн\ue205къ GH",
            "пр\ue205\ue20dѧстьн\ue205къ бꙑт\ue205 GH",
            "",
            "05/28c21",
            "пр\ue205\ue20dьтьн\ue205ц\ue205",
            "да пр\ue205\ue20dьтьн\ue205ц\ue205",
            "пр\ue205\ue20dьтьн\ue205къ",
            "пр\ue205\ue20dьтьн\ue205къ быт\ue205",
            "",
            "",
            "ποιῆσαι",
            "ποιέω",
            "ποιέω κοινωνόν",
        ]
        + [""] * 12
        + ["hl05|hl11"],
        ["боудемь W"]
        + ["бꙑт"]
        + [""] * 2
        + ["05/28d01", "боудоуть", "боудоуть• \ue201же", "бꙑт\ue205"]
        + [""] * 3
        + ["κοινωνοὺς", "κοινωνός"]
        + [""] * 13
        + ["hl05|hl11"],
    ]

    assert (
        sl_sem.var.collect_word(rows)
        # == "пр\ue205\ue20dестьн\ue205ц\ue205 б• G пр\ue205\ue20dестн\ue205ц\ue205 б• H боудемь W"
        == "боудемь W пр\ue205\ue20dестьн\ue205ц\ue205 б• G пр\ue205\ue20dестн\ue205ц\ue205 б• H"
    )


def test_hoditi_spiti():
    rows = [
        [
            "хⷪ҇домь спѣюще WG ход\ue205т\ue205 с пѣн\ue205\ue201мь H",
            "ходъ WG",
            "ходомь спѣт\ue205 WG",
            "",
            "14/72d18",
            "ход\ue205мъ",
            "себе• по поут\ue205 хо-",
            "ход\ue205т\ue205",
            "≈ ход\ue205т\ue205 спѣѭще",
            "",
            "",
            "προβαίνοντες",
            "προβαίνω",
        ]
        + [""] * 13
        + ["hl05"],
        [""] * 4
        + ["14/72d19", "спѣюще•", "д\ue205мъ спѣюще•", "спѣт\ue205"]
        + [""] * 18
        + ["hl05"],
    ]

    assert (
        sl_sem.var.collect_word(rows)
        == "хⷪ҇домь спѣюще WG ход\ue205т\ue205 с пѣн\ue205\ue201мь H"
    )
    assert gr_sem.collect_word(rows) == "προβαίνοντες"


def test_collect_word_same():
    rows = [
        [""] * 4
        + ["35/163a07", "въспꙗть", "\ue205 в\ue205дѣвъ• въ-", "въспѧть"]
        + [""] * 3
        + ["εἰς"] * 2
        + ["εἰς τοὐπίσω"]
        + [""] * 12
        + ["hl11:FFFCD5B4"],
        [""] * 5
        + ["ₓ", ""] * 2
        + [""] * 2
        + ["τοὐπίσω", "ὁ"]
        + [""] * 13
        + ["hl11:FFFCD5B4|hl14:FFB8CCE4"],
        [""] * 11 + ["=", "ὀπίσω"] + [""] * 13 + ["hl11:FFFCD5B4"],
    ]

    assert gr_sem.collect_word(rows) == "εἰς τοὐπίσω"


"""
def test_iako_obrazom():
    rows = [
        [
            "ꙗко WGH",
            "ꙗко",
            "ꙗко",
            "",
            "51/232d03",
            "ꙗкоже",
            "ꙗкоже \ue205 обра-",
            "ꙗкоже",
            "ꙗкоже \ue205 обраꙁомь",
            "",
            "",
            "προσχήματι",
            "πρόσχημα",
            "προσχήματι μέν",
        ]
        + [""] * 12
        + ["hl05:FFFCD5B4"],
        [
            "om. WG",
            "\ue205 conj. H",
            "\ue205 H",
            "",
            "51/232d03",
            "\ue205",
            "ꙗкоже \ue205 обра-",
            "\ue205 conj.",
        ]
        + [""] * 3
        + ["μὲν", "μέν"]
        + [""] * 13
        + ["hl05:FFFCD5B4"],
        [
            "обраꙁомь WGH",
            "обраꙁъ",
            "обраꙁомь",
            "",
            "51/232d03",
            "обраꙁъмь",
            "ꙗкоже \ue205 обра-",
            "обраꙁъ",
        ]
        + [""] * 18
        + ["hl05:FFFCD5B4"],
    ]
    result = sl_sem.var.collect_word(rows)
    assert result == "ꙗко обраꙁомь WG ꙗко \ue205 обраꙁомь H"
"""
